openwsn-berkeley/openwsn-fw/bsp/boards/OpenMote-CC2538/board.c
/**
 * Author: Xavier Vilajosana (xvilajosana@eecs.berkeley.edu)
 *         Pere Tuset (peretuset@openmote.com)
 * Date:   July 2013
 * Description: CC2538-specific definition of the "board" bsp module.
 */

#include <headers/hw_ints.h>
#include <headers/hw_ioc.h>
#include <headers/hw_memmap.h>
#include <headers/hw_ssi.h>
#include <headers/hw_sys_ctrl.h>
#include <headers/hw_types.h>

#include <source/sleepmode.h>

#include "board.h"
#include "leds.h"
#include "ioc.h"
#include "gpio.h"
#include "sys_ctrl.h"
#include "interrupt.h"
#include "bsp_timer.h"
#include "radiotimer.h"
#include "debugpins.h"
#include "uart.h"
#include "radio.h"
#include "flash.h"
#include "i2c.h"
#include "gptimer.h"
#include "sensors.h"

//=========================== variables =======================================
#define BOARD_REVISION_D                ( 4 )
#define BOARD_REVISION_E                ( 5 )
#define BOARD_REVISION                  ( BOARD_REVISION_E )

#define BSP_ANTENNA_BASE                ( GPIO_D_BASE )
#define BSP_ANTENNA_INT                 ( GPIO_PIN_5 )
#define BSP_ANTENNA_EXT                 ( GPIO_PIN_4 )

#define BSP_BUTTON_BASE                 ( GPIO_C_BASE )
#define BSP_BUTTON_USER                 ( GPIO_PIN_3 )

#define CC2538_FLASH_ADDRESS            ( 0x0027F800 )

#define LPM1_MINIMUM_IDLE_TICKS         ( 10 )
#define LPM1_WAKEUP_TICKS               ( 0 )
#define LPM2_MINIMUM_IDLE_TICKS         ( 100 )
#define LPM2_WAKEUP_TICKS               ( 9 )

//=========================== prototypes ======================================


static void board_suspend(void);
static void board_wakeup(bool uart, bool radio);
static void board_isr_wakeup(void);

void antenna_init(void);
void antenna_internal(void);
void antenna_external(void);

void board_timer_init(void);
uint32_t board_timer_get(void);
bool board_timer_expired(uint32_t future);

static void clock_init(void);
static void gpio_init(void);
static void button_init(void);

static void SysCtrlDeepSleepSetting(void);
static void SysCtrlSleepSetting(void);
static void SysCtrlRunSetting(void);
static void SysCtrlWakeupSetting(void);

static void GPIO_C_Handler(void);

//=========================== main ============================================

extern int mote_main(void);

int main(void) {
   return mote_main();
}

//=========================== public ==========================================

void board_init(void) {
   gpio_init();
   clock_init();

   board_timer_init();

   antenna_init();
   antenna_external();

   leds_init();
   debugpins_init();
 //  button_init();
   bsp_timer_init();
   radiotimer_init();
   uart_init();
   radio_init();
   i2c_init();
   sensors_init();
  // leds_all_on();
}

/**
 * Puts the board to sleep
 */
void board_sleep(void) {
    PORT_TIMER_WIDTH current_ticks, sleep_ticks;
    PORT_TIMER_WIDTH bsp_ticks, radio_ticks, wakeup_ticks;
    bool radio_is_active;
    bool uart_is_active;
    bool deep_sleep;

    // Get the next wake-up time, needs to be the minimum
    // between the bsp_timer and the radio_timer
    // Both bsp_timer and radiotimer operate at 32 MHz
    // but return a number of ticks at 32.768 kHz


   //FAKE
   /* SysCtrlPowerModeSet(SYS_CTRL_PM_NOACTION);
    SysCtrlSleep();
    return;
   */

//    bsp_ticks    = bsp_timer_get_remainingValue();
    radio_ticks  = radiotimer_get_remainingValue();
  //  sleep_ticks  = (bsp_ticks < radio_ticks ? bsp_ticks : radio_ticks);
    sleep_ticks  = radio_ticks;

    // Check if uart or radio are active
    // If so, we cannot go to deep sleep
    radio_is_active = radio_isActive();
    uart_is_active  = uart_isActive();
    radio_is_active = false;
    uart_is_active  = false;



    // Decide the low power mode based on the expected sleep time
    if (sleep_ticks < LPM1_MINIMUM_IDLE_TICKS || radio_is_active || uart_is_active) { // Go to LPM0
        deep_sleep = false;
    	SysCtrlPowerModeSet(SYS_CTRL_PM_NOACTION);
    } else if (sleep_ticks < LPM2_MINIMUM_IDLE_TICKS) { // Go to LPM1
        deep_sleep = true;
        wakeup_ticks = 0;
    	SysCtrlPowerModeSet(SYS_CTRL_PM_1);
    } else { // Go to LPM2
        deep_sleep = true;
        wakeup_ticks = 5;
        SysCtrlPowerModeSet(SYS_CTRL_PM_2);
    }

    // If we can go to deep sleep, we need to setup the sleep timer to wake us up
    if (deep_sleep) {
        // If we go to deep sleep we need to stop the
        // bsp_timer and radiotimer modules
    //    bsp_timer_suspend();
        radiotimer_suspend();

        // Register and enable the wake-up interrupt
        IntRegister(INT_SMTIM, board_isr_wakeup);
        IntEnable(INT_SMTIM);

        // Get the present number of ticks
        current_ticks = SleepModeTimerCountGet();

        // Set the compare register
        SleepModeTimerCompareSet(current_ticks + sleep_ticks - wakeup_ticks);

        // Suspend the hardware
        board_suspend();

        // Go to the selected sleep mode
        SysCtrlDeepSleep();
    } else {
        SysCtrlSleep();
    }

    // Wake-up will take place at board_isr_wakeup
    // and will eventually come back here

    // Check if we went to deep-sleep
    if (deep_sleep) {
        // Disable the wake-up interrupt
        IntDisable(INT_SMTIM);

        // Re-enable the hardware
        board_wakeup(uart_is_active, radio_is_active);

        // If we went to deep sleep we need to re-enable
        // the bsp_timer and the radiotimer
        // Notice callbacks will be executed here
        // bsp_timer_wakeup(sleep_ticks);
        radiotimer_wakeup(sleep_ticks);
    }
}


/**
 * Readies the board to go to sleep
 */
static void board_suspend(void) {
    // Disable the radio and uart
    // radio_suspend();
    // uart_suspend();
}

/**
 * Recovers the board from sleep
 */
static void board_wakeup(bool uart, bool radio) {
    if (uart) {
        uart_init();
    }

    if (radio) {
        radio_init();
    }
}

/**
 * Timer runs at 32 MHz and is 32-bit wide
 * The timer is divided by 32, whichs gives a 1 microsecond ticks
 */
void board_timer_init(void) {
	// Configure the timer
	TimerConfigure(GPTIMER2_BASE, GPTIMER_CFG_PERIODIC_UP);
	
	// Enable the timer
    TimerEnable(GPTIMER2_BASE, GPTIMER_BOTH);
}

/**
 * Returns the current value of the timer
 * The timer is divided by 32, whichs gives a 1 microsecond ticks
 */
uint32_t board_timer_get(void) {
    uint32_t current;
    
    current = TimerValueGet(GPTIMER2_BASE, GPTIMER_A) >> 5;
    
    return current;
}

/**
 * Returns true if the timer has expired
 * The timer is divided by 32, whichs gives a 1 microsecond ticks
 */
bool board_timer_expired(uint32_t future) {
    uint32_t current;
    int32_t remaining;

    current = TimerValueGet(GPTIMER2_BASE, GPTIMER_A) >> 5;

    remaining = (int32_t) (future - current);
    
    if (remaining > 0) {
        return false;
    } else {
        return true;
    }
}

/**
 * Resets the board
 */
void board_reset(void) {
	SysCtrlReset();
}

/**
 * Configures the antenna using a RF switch
 * INT is the internal antenna (chip) configured through ANT1_SEL (V1)
 * EXT is the external antenna (connector) configured through ANT2_SEL (V2)
 */
void antenna_init(void) {
    /* Configure the ANT1 and ANT2 GPIO as output */
    GPIOPinTypeGPIOOutput(BSP_ANTENNA_BASE, BSP_ANTENNA_INT);
    GPIOPinTypeGPIOOutput(BSP_ANTENNA_BASE, BSP_ANTENNA_EXT);

    /* By default the chip antenna is selected as the default */
    GPIOPinWrite(BSP_ANTENNA_BASE, BSP_ANTENNA_INT, BSP_ANTENNA_INT);
    GPIOPinWrite(BSP_ANTENNA_BASE, BSP_ANTENNA_EXT, ~BSP_ANTENNA_EXT);
}

/**
 * Selects the external (connector) antenna
 */
void antenna_external(void) {
    GPIOPinWrite(BSP_ANTENNA_BASE, BSP_ANTENNA_EXT, BSP_ANTENNA_EXT);
    GPIOPinWrite(BSP_ANTENNA_BASE, BSP_ANTENNA_INT, ~BSP_ANTENNA_INT);
}

/**
 * Selects the internal (chip) antenna
 */
void antenna_internal(void) {
    GPIOPinWrite(BSP_ANTENNA_BASE, BSP_ANTENNA_EXT, ~BSP_ANTENNA_EXT);
    GPIOPinWrite(BSP_ANTENNA_BASE, BSP_ANTENNA_INT, BSP_ANTENNA_INT);
}

//=========================== private =========================================

static void gpio_init(void) {
    /* Set GPIOs as output */
    GPIOPinTypeGPIOOutput(GPIO_A_BASE, 0xFF);
    GPIOPinTypeGPIOOutput(GPIO_B_BASE, 0xFF);
    GPIOPinTypeGPIOOutput(GPIO_C_BASE, 0xFF);
    GPIOPinTypeGPIOOutput(GPIO_D_BASE, 0xFF);

    /* Initialize GPIOs to low */
    GPIOPinWrite(GPIO_A_BASE, 0xFF, 0x00);
    GPIOPinWrite(GPIO_B_BASE, 0xFF, 0x00);
    GPIOPinWrite(GPIO_C_BASE, 0xFF, 0x00);
    GPIOPinWrite(GPIO_D_BASE, 0xFF, 0x00);
}

static void clock_init(void) {
    /* Disable global interrupts */
    bool bIntDisabled = IntMasterDisable();

    /* Configure the 32 kHz pins, PD6 and PD7, for crystal operation */
    /* By default they are configured as GPIOs */
    GPIODirModeSet(GPIO_D_BASE, 0x40, GPIO_DIR_MODE_IN);
    GPIODirModeSet(GPIO_D_BASE, 0x80, GPIO_DIR_MODE_IN);
    IOCPadConfigSet(GPIO_D_BASE, 0x40, IOC_OVERRIDE_ANA);
    IOCPadConfigSet(GPIO_D_BASE, 0x80, IOC_OVERRIDE_ANA);

    /* Set the real-time clock to use the 32 kHz external crystal */
    /* Set the system clock to use the external 32 MHz crystal */
    /* Set the system clock to 32 MHz */
    SysCtrlClockSet(true, false, SYS_CTRL_SYSDIV_32MHZ);

    /* Set the IO clock to operate at 16 MHz */
    /* This way peripherals can run while the system clock is gated */
    SysCtrlIOClockSet(SYS_CTRL_SYSDIV_16MHZ);

    /* Wait until the selected clock configuration is stable */
    while (!((HWREG(SYS_CTRL_CLOCK_STA)) & (SYS_CTRL_CLOCK_STA_XOSC_STB)));

    /* Define what peripherals run in each mode */
    SysCtrlRunSetting();
    SysCtrlSleepSetting();
    SysCtrlDeepSleepSetting();
    SysCtrlWakeupSetting();

    /* Re-enable interrupt if initially enabled */
    if (!bIntDisabled) {
        IntMasterEnable();
    }
}

/**
 * Configures the user button as input source
 */
static void button_init(void) {
    volatile uint32_t i;

    /* Delay to avoid pin floating problems */
    for (i = 0xFFFF; i != 0; i--);

    /* The button is an input GPIO on falling edge */
    GPIOPinTypeGPIOInput(BSP_BUTTON_BASE, BSP_BUTTON_USER);
    GPIOIntTypeSet(BSP_BUTTON_BASE, BSP_BUTTON_USER, GPIO_FALLING_EDGE);

    /* Register the interrupt */
    GPIOPortIntRegister(BSP_BUTTON_BASE, GPIO_C_Handler);

    /* Clear and enable the interrupt */
    GPIOPinIntClear(BSP_BUTTON_BASE, BSP_BUTTON_USER);
    GPIOPinIntEnable(BSP_BUTTON_BASE, BSP_BUTTON_USER);
}

static void SysCtrlRunSetting(void) {
  /* Disable General Purpose Timers 0, 1, 2, 3 when running */

  SysCtrlPeripheralDisable(SYS_CTRL_PERIPH_GPT3);

  /* Disable SSI 0, 1 when running */
  SysCtrlPeripheralDisable(SYS_CTRL_PERIPH_SSI0);
  SysCtrlPeripheralDisable(SYS_CTRL_PERIPH_SSI1);

  /* Disable UART1 when running */
  SysCtrlPeripheralDisable(SYS_CTRL_PERIPH_UART1);

  /* Disable I2C, AES and PKA when running */
  SysCtrlPeripheralDisable(SYS_CTRL_PERIPH_I2C);
  SysCtrlPeripheralDisable(SYS_CTRL_PERIPH_PKA);
  SysCtrlPeripheralDisable(SYS_CTRL_PERIPH_AES);

  /* Enable UART0 and RFC when running */
  SysCtrlPeripheralEnable(SYS_CTRL_PERIPH_GPT0);
  SysCtrlPeripheralEnable(SYS_CTRL_PERIPH_GPT1);
  SysCtrlPeripheralEnable(SYS_CTRL_PERIPH_GPT2);
  SysCtrlPeripheralEnable(SYS_CTRL_PERIPH_UART0);
  SysCtrlPeripheralEnable(SYS_CTRL_PERIPH_RFC);
}

static void SysCtrlSleepSetting(void) {
  /* Disable General Purpose Timers 0, 1, 2, 3 during sleep */
  SysCtrlPeripheralSleepDisable(SYS_CTRL_PERIPH_GPT3);

  /* Disable SSI 0, 1 during sleep */
  SysCtrlPeripheralSleepDisable(SYS_CTRL_PERIPH_SSI0);
  SysCtrlPeripheralSleepDisable(SYS_CTRL_PERIPH_SSI1);

  /* Disable UART 0, 1 during sleep */
  SysCtrlPeripheralSleepDisable(SYS_CTRL_PERIPH_UART1);

  /* Disable I2C, PKA, AES during sleep */
  SysCtrlPeripheralSleepDisable(SYS_CTRL_PERIPH_I2C);
  SysCtrlPeripheralSleepDisable(SYS_CTRL_PERIPH_PKA);
  SysCtrlPeripheralSleepDisable(SYS_CTRL_PERIPH_AES);

  /* Enable UART and RFC during sleep */
  SysCtrlPeripheralSleepEnable(SYS_CTRL_PERIPH_GPT0);
  SysCtrlPeripheralSleepEnable(SYS_CTRL_PERIPH_GPT1);
  SysCtrlPeripheralSleepEnable(SYS_CTRL_PERIPH_GPT2);
  SysCtrlPeripheralSleepEnable(SYS_CTRL_PERIPH_UART0);
  SysCtrlPeripheralSleepEnable(SYS_CTRL_PERIPH_RFC);
}

static void SysCtrlDeepSleepSetting(void) {
  /* Disable General Purpose Timers 0, 1, 2, 3 during deep sleep */
  SysCtrlPeripheralDeepSleepDisable(SYS_CTRL_PERIPH_GPT0);
  SysCtrlPeripheralDeepSleepDisable(SYS_CTRL_PERIPH_GPT1);
  SysCtrlPeripheralDeepSleepDisable(SYS_CTRL_PERIPH_GPT2);
  SysCtrlPeripheralDeepSleepDisable(SYS_CTRL_PERIPH_GPT3);

  /* Disable SSI 0, 1 during deep sleep */
  SysCtrlPeripheralDeepSleepDisable(SYS_CTRL_PERIPH_SSI0);
  SysCtrlPeripheralDeepSleepDisable(SYS_CTRL_PERIPH_SSI1);

  /* Disable UART 0, 1 during deep sleep */
  SysCtrlPeripheralDeepSleepDisable(SYS_CTRL_PERIPH_UART0);
  SysCtrlPeripheralDeepSleepDisable(SYS_CTRL_PERIPH_UART1);

  /* Disable I2C, PKA, AES during deep sleep */
  SysCtrlPeripheralDeepSleepDisable(SYS_CTRL_PERIPH_I2C);
  SysCtrlPeripheralDeepSleepDisable(SYS_CTRL_PERIPH_PKA);
  SysCtrlPeripheralDeepSleepDisable(SYS_CTRL_PERIPH_AES);
  SysCtrlPeripheralDeepSleepDisable(SYS_CTRL_PERIPH_RFC);
}

static void SysCtrlWakeupSetting(void) {
  /* Allow the SMTimer to wake up the processor */
  GPIOIntWakeupEnable(GPIO_IWE_SM_TIMER);
}

//=========================== interrupt handlers ==============================

/**
 * GPIO_C interrupt handler. User button is GPIO_C_3
 * Erases a Flash sector to trigger the bootloader backdoor
 */
static void GPIO_C_Handler(void) {
    /* Disable the interrupts */
    IntMasterDisable();

    /* Eras the CCA flash page */
    FlashMainPageErase(CC2538_FLASH_ADDRESS);

    /* Reset the board */
    SysCtrlReset();
}

static void board_isr_wakeup(void) {
    // Wait until the clocks are stable
    while(HWREG(SYS_CTRL_CLOCK_STA) & SYS_CTRL_CLOCK_STA_SYNC_32K);
    while((!HWREG(SYS_CTRL_CLOCK_STA)) & SYS_CTRL_CLOCK_STA_SYNC_32K);

    // Clear the timer interrupt
    IntPendClear(INT_SMTIM);
}
